Revit 2024 API
BuiltInFailures.PathOfTravelFailures.UpdateFailureSingle Property
 Path of Travel failed to update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UpdateFailureSingle { get; }
Visual Basic
Public Shared ReadOnly Property UpdateFailureSingle As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UpdateFailureSingle {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PathOfTravelFailures Class
Autodesk.Revit.DB Namespace